/************************************************************ 
 * 文件： Timer.h
 * 作者: 
 * 平台: 
 * 版本:
************************************************************/
#ifndef __TIMER_H
#define __TIMER_H

/************************* 头文件 *************************/

#include "HeaderFiles.h"

/************************* 宏定义 *************************/


/************************ 变量定义 ************************/


/************************ 函数声明 ************************/
void             InitTimer(void);       //初始化Timer模块
unsigned char    get_5ms_Flag(void);    //获取5ms标志位的值
void             clear_5ms_flag(void);  //清除5ms标志位
unsigned char    get_1s_Flag(void);     //获取1s标志位的值
void             clear_1s_flag(void);   //清除1s标志位
#endif

/****************************End*****************************/
